{
    "name": "Nahome Kifle",
    "headerTaglineOne": "Hello",
    "headerTaglineTwo": "I'm Nahome Kifle - curious",
    "headerTaglineThree": "designer and developer",
    "headerTaglineFour": "based in Phoenix, Arizona.",
    "showCursor": true,
    "showBlog": true,
    "darkMode": true,
    "showResume": true,
    "socials": [
      {
        "id": "1",
        "title": "Github",
        "link": "https://github.com/NahomeKifle"
      },
      {
        "id": "2",
        "title": "LinkedIn",
        "link": "https://www.linkedin.com/in/nahome-kifle/"
      }
    ],
    "projects": [
      {
        "id": "1",
        "title": "TSA Wait Time & Departure Planning Backend",
        "description": "Full Stack",
        "imageSrc": "/images/TsaApp.avif",
        "url": "https://github.com/NahomeKifle/TSA-tracker-app"
      },
      {
        "id": "2",
        "title": "Ethiopian Cultural Store",
        "description": "Full Stack",
        "imageSrc": "/images/Ethiopiap3.webp",
        "url": "https://github.com/NahomeKifle/Ethiopian-Cultural-Store"
      }
    ],
    "services": [
      {
        "id": "1",
        "title": "Backend Engineering",
        "description": "I design and build backend services and APIs that power internal tools and data-driven applications, with a focus on reliability, performance, and clean system design."
      },
      {
        "id": "2",
        "title": "Data Engineering",
        "description": "I design and implement data pipelines using PySpark, BigQuery, and Airflow to process large datasets and enable data-driven decision making."
      },
      {
        "id": "3",
        "title": "Cloud Solutions",
        "description": "I develop and deploy applications on cloud platforms like Google Cloud Platform and AWS, ensuring scalability, security, and optimal performance."
      },
      {
        "id": "4",
        "title": "Full Stack Development",
        "description": "I build complete web applications using modern technologies like React, Node.js, and cloud platforms to deliver scalable and efficient solutions."
      }
    ],
    "aboutpara": "I'm a passionate Software Engineer with expertise in full-stack development, data engineering, and cloud technologies. I love building scalable systems that solve real-world problems and improve efficiency. With experience in both enterprise environments and startup settings, I bring a unique perspective to software development. When I'm not coding, you can find me exploring new technologies, contributing to open-source projects, or mentoring fellow developers.",
    "resume": {
      "tagline": "👋 I'm a Software Engineer passionate about scalable systems and data-driven solutions.",
      "description": "Experienced in full-stack development, big data pipelines, and cloud platforms. I design, build, and optimize systems that improve performance and reliability across applications.",
      "experiences": [
        {
          "id": "1",
          "dates": "June 2025 - Present",
          "type": "Full Time",
          "position": "Software Engineer, American Express | Phoenix, AZ",
          "bullets": "Enhanced efficiency and scalability of enterprise finance systems by developing and deploying new data pipelines in Google Cloud (BigQuery, DataProc, Airflow), improving data storage organization and accessibility across global reporting platforms. Optimized data processing workflows by engineering high-performance ETL solutions using PySpark, Python, and Hive, resulting in a 35% reduction in data latency and enabling faster, more reliable delivery of insights for compliance and business analytics."
        },
        {
          "id": "2",
          "dates": "September 2024 - Present",
          "type": "Internship",
          "position": "Database Manager Intern, VCU Health Hub | Richmond, VA",
          "bullets": "Increased client data management efficiency by 100% by streamlining data collection through the transfer of Google Sheet responses to a PostgreSQL database using Flask and psycopg2, tracking data for 500+ clients monthly. Developed a responsive front-end interface with HTML, CSS, and Bootstrap to display data and provided stakeholders with detailed monthly insights."
        },
        {
          "id": "3",
          "dates": "August 2024 - Present",
          "type": "Internship",
          "position": "Software Engineering Intern, VCU Hospital | Richmond, VA",
          "bullets": "Improved data retrieval efficiency by 35% by implementing a dynamic front-end with React.js, optimizing back-end processes with Node.js, and utilizing PostgreSQL for simple data storage and retrieval. Tested and validated the scalability of an AI-driven search with GPT integration and Docker-Compose, ensuring response times remained under 200ms for 100+ concurrent users using JMeter."
        },
        {
          "id": "4",
          "dates": "October 2023 - Present",
          "type": "Part Time",
          "position": "Java Tutor, Superprof | Remote",
          "bullets": "Taught core Java concepts, including OOP, data structures, and debugging, while creating personalized lesson plans with hands-on coding exercises to improve comprehension and technical skills."
        }
      ],
      "education": {
        "universityName": "Virginia Commonwealth University, School of Engineering and Applied Science",
        "universityDate": "May 2025",
        "universityPara": "B.S. in Computer Science with a concentration in Software Engineering, Richmond, VA."
      },
      "languages": ["Java", "Python", "SQL (MySQL, PostgreSQL, BigQuery, Hive)", "PHP", "C", "JavaScript", "HTML/CSS"],
      "frameworks": ["Spring Boot", "Flask", "Node.js", "React.js", "Bootstrap", "REST", "Git", "JUnit", "Gradle"],
      "others": ["PySpark", "Hadoop", "Airflow/Composer", "Google Cloud Platform (GCP)", "AWS"]
    }
  }
  